{
  "questions": [
    {
      "id": 1,
      "question": "What are the different ways to declare variables in JavaScript?"
    },
    {
      "id": 2,
      "question": "Explain the difference between var, let, and const in JavaScript."
    },
    {
      "id": 3,
      "question": "What are JavaScript primitive data types?"
    },
    {
      "id": 4,
      "question": "How is a Number declared in JavaScript?"
    },
    {
      "id": 5,
      "question": "Give an example of declaring a string in JavaScript."
    },
    {
      "id": 6,
      "question": "What is a Boolean in JavaScript and how is it used?"
    },
    {
      "id": 7,
      "question": "What is the value of a variable that is declared but not assigned a value?"
    },
    {
      "id": 8,
      "question": "What is the difference between null and undefined?"
    },
    {
      "id": 9,
      "question": "What happens if you try to reassign a const variable?"
    },
    {
      "id": 10,
      "question": "Can you declare a variable without using var, let, or const? What happens?"
    },
    {
      "id": 11,
      "question": "How do you check the type of a variable in JavaScript?"
    },
    {
      "id": 12,
      "question": "What does the typeof operator return for null?"
    },
    {
      "id": 13,
      "question": "Is '123' (a string) the same as 123 (a number) in JavaScript?"
    },
    {
      "id": 14,
      "question": "Can primitive data types hold multiple values?"
    },
    {
      "id": 15,
      "question": "How does JavaScript handle dynamic typing with primitive types?"
    },
    {
      "id": 16,
      "question": "What is hoisting and how does it affect var declarations?"
    },
    {
      "id": 17,
      "question": "Which variable keyword allows block-scoped declarations?"
    },
    {
      "id": 18,
      "question": "Is JavaScript statically or dynamically typed?"
    },
    {
      "id": 19,
      "question": "What is the default value of a variable declared with var but not initialized?"
    },
    {
      "id": 20,
      "question": "Can a string in JavaScript include special characters like newline or tab?"
    },
    {
      "id": 21,
      "question": "What is the result of typeof undefined?"
    },
    {
      "id": 22,
      "question": "What is the result of typeof null?"
    },
    {
      "id": 23,
      "question": "How do you create a variable that cannot be reassigned?"
    },
    {
      "id": 24,
      "question": "Which keyword should you use when you want to declare a variable that may change later?"
    },
    {
      "id": 25,
      "question": "Why is it generally recommended to use let or const instead of var?"
    }
  ]
}
